SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_agc.h
/* Bit fields for AGC FENOTCHATT4 */
#define _AGC_FENOTCHATT4_RESETVALUE                    0x00000000UL                                      /**< Default value for AGC_FENOTCHATT4           */
#define _AGC_FENOTCHATT4_MASK                          0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHATT4                    */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL9_SHIFT         0                                                 /**< Shift value for AGC_FENOTCHATTNSEL9         */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL9_MASK          0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL9            */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL9_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHATTNSEL9_DEFAULT        (_AGC_FENOTCHATT4_FENOTCHATTNSEL9_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE9_SHIFT         4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE9         */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE9_MASK          0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE9            */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE9_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHCAPCRSE9_DEFAULT        (_AGC_FENOTCHATT4_FENOTCHCAPCRSE9_DEFAULT << 4)   /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE9_SHIFT         8                                                 /**< Shift value for AGC_FENOTCHCAPFINE9         */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE9_MASK          0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE9            */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE9_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHCAPFINE9_DEFAULT        (_AGC_FENOTCHATT4_FENOTCHCAPFINE9_DEFAULT << 8)   /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define AGC_FENOTCHATT4_FENOTCHRATTNEN9                (0x1UL << 12)                                     /**< FE notch rattn enable for index 9           */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN9_SHIFT         12                                                /**< Shift value for AGC_FENOTCHRATTNEN9         */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN9_MASK          0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN9            */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN9_DEFAULT       0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHRATTNEN9_DEFAULT        (_AGC_FENOTCHATT4_FENOTCHRATTNEN9_DEFAULT << 12)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define AGC_FENOTCHATT4_FENOTCHEN9                     (0x1UL << 13)                                     /**< FE notch enable for index 9                 */
#define _AGC_FENOTCHATT4_FENOTCHEN9_SHIFT              13                                                /**< Shift value for AGC_FENOTCHEN9              */
#define _AGC_FENOTCHATT4_FENOTCHEN9_MASK               0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN9                 */
#define _AGC_FENOTCHATT4_FENOTCHEN9_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHEN9_DEFAULT             (_AGC_FENOTCHATT4_FENOTCHEN9_DEFAULT << 13)       /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL10_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL10        */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL10_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL10           */
#define _AGC_FENOTCHATT4_FENOTCHATTNSEL10_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHATTNSEL10_DEFAULT       (_AGC_FENOTCHATT4_FENOTCHATTNSEL10_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE10_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE10        */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE10_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE10           */
#define _AGC_FENOTCHATT4_FENOTCHCAPCRSE10_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHCAPCRSE10_DEFAULT       (_AGC_FENOTCHATT4_FENOTCHCAPCRSE10_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE10_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE10        */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE10_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE10           */
#define _AGC_FENOTCHATT4_FENOTCHCAPFINE10_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHCAPFINE10_DEFAULT       (_AGC_FENOTCHATT4_FENOTCHCAPFINE10_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define AGC_FENOTCHATT4_FENOTCHRATTNEN10               (0x1UL << 28)                                     /**< FE notch rattn enable for index 10          */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN10_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN10        */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN10_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN10           */
#define _AGC_FENOTCHATT4_FENOTCHRATTNEN10_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHRATTNEN10_DEFAULT       (_AGC_FENOTCHATT4_FENOTCHRATTNEN10_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */
#define AGC_FENOTCHATT4_FENOTCHEN10                    (0x1UL << 29)                                     /**< FE notch enable for index 10                */
#define _AGC_FENOTCHATT4_FENOTCHEN10_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN10             */
#define _AGC_FENOTCHATT4_FENOTCHEN10_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN10                */
#define _AGC_FENOTCHATT4_FENOTCHEN10_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT4            */
#define AGC_FENOTCHATT4_FENOTCHEN10_DEFAULT            (_AGC_FENOTCHATT4_FENOTCHEN10_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT4    */

/* Bit fields for AGC FENOTCHATT5 */
#define _AGC_FENOTCHATT5_RESETVALUE                    0x00000000UL                                      /**< Default value for AGC_FENOTCHATT5           */
#define _AGC_FENOTCHATT5_MASK                          0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHATT5                    */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL11_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL11        */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL11_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL11           */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL11_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHATTNSEL11_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHATTNSEL11_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE11_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE11        */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE11_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE11           */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE11_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHCAPCRSE11_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHCAPCRSE11_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE11_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE11        */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE11_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE11           */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE11_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHCAPFINE11_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHCAPFINE11_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define AGC_FENOTCHATT5_FENOTCHRATTNEN11               (0x1UL << 12)                                     /**< FE notch rattn enable for index 11          */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN11_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN11        */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN11_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN11           */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN11_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHRATTNEN11_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHRATTNEN11_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define AGC_FENOTCHATT5_FENOTCHEN11                    (0x1UL << 13)                                     /**< FE notch enable for index 11                */
#define _AGC_FENOTCHATT5_FENOTCHEN11_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN11             */
#define _AGC_FENOTCHATT5_FENOTCHEN11_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN11                */
#define _AGC_FENOTCHATT5_FENOTCHEN11_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHEN11_DEFAULT            (_AGC_FENOTCHATT5_FENOTCHEN11_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL12_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL12        */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL12_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL12           */
#define _AGC_FENOTCHATT5_FENOTCHATTNSEL12_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHATTNSEL12_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHATTNSEL12_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE12_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE12        */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE12_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE12           */
#define _AGC_FENOTCHATT5_FENOTCHCAPCRSE12_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHCAPCRSE12_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHCAPCRSE12_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE12_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE12        */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE12_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE12           */
#define _AGC_FENOTCHATT5_FENOTCHCAPFINE12_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHCAPFINE12_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHCAPFINE12_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define AGC_FENOTCHATT5_FENOTCHRATTNEN12               (0x1UL << 28)                                     /**< FE notch rattn enable for index 12          */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN12_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN12        */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN12_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN12           */
#define _AGC_FENOTCHATT5_FENOTCHRATTNEN12_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHRATTNEN12_DEFAULT       (_AGC_FENOTCHATT5_FENOTCHRATTNEN12_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */
#define AGC_FENOTCHATT5_FENOTCHEN12                    (0x1UL << 29)                                     /**< FE notch enable for index 12                */
#define _AGC_FENOTCHATT5_FENOTCHEN12_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN12             */
#define _AGC_FENOTCHATT5_FENOTCHEN12_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN12                */
#define _AGC_FENOTCHATT5_FENOTCHEN12_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT5            */
#define AGC_FENOTCHATT5_FENOTCHEN12_DEFAULT            (_AGC_FENOTCHATT5_FENOTCHEN12_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT5    */

/* Bit fields for AGC FENOTCHATT6 */
#define _AGC_FENOTCHATT6_RESETVALUE                    0x00000000UL                                      /**< Default value for AGC_FENOTCHATT6           */
#define _AGC_FENOTCHATT6_MASK                          0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHATT6                    */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL13_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL13        */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL13_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL13           */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL13_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHATTNSEL13_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHATTNSEL13_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE13_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE13        */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE13_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE13           */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE13_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHCAPCRSE13_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHCAPCRSE13_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE13_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE13        */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE13_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE13           */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE13_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHCAPFINE13_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHCAPFINE13_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define AGC_FENOTCHATT6_FENOTCHRATTNEN13               (0x1UL << 12)                                     /**< FE notch rattn enable for index 13          */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN13_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN13        */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN13_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN13           */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN13_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHRATTNEN13_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHRATTNEN13_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define AGC_FENOTCHATT6_FENOTCHEN13                    (0x1UL << 13)                                     /**< FE notch enable for index 13                */
#define _AGC_FENOTCHATT6_FENOTCHEN13_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN13             */
#define _AGC_FENOTCHATT6_FENOTCHEN13_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN13                */
#define _AGC_FENOTCHATT6_FENOTCHEN13_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHEN13_DEFAULT            (_AGC_FENOTCHATT6_FENOTCHEN13_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL14_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL14        */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL14_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL14           */
#define _AGC_FENOTCHATT6_FENOTCHATTNSEL14_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHATTNSEL14_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHATTNSEL14_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE14_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE14        */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE14_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE14           */
#define _AGC_FENOTCHATT6_FENOTCHCAPCRSE14_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHCAPCRSE14_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHCAPCRSE14_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE14_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE14        */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE14_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE14           */
#define _AGC_FENOTCHATT6_FENOTCHCAPFINE14_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHCAPFINE14_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHCAPFINE14_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define AGC_FENOTCHATT6_FENOTCHRATTNEN14               (0x1UL << 28)                                     /**< FE notch rattn enable for index 14          */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN14_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN14        */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN14_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN14           */
#define _AGC_FENOTCHATT6_FENOTCHRATTNEN14_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHRATTNEN14_DEFAULT       (_AGC_FENOTCHATT6_FENOTCHRATTNEN14_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */
#define AGC_FENOTCHATT6_FENOTCHEN14                    (0x1UL << 29)                                     /**< FE notch enable for index 14                */
#define _AGC_FENOTCHATT6_FENOTCHEN14_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN14             */
#define _AGC_FENOTCHATT6_FENOTCHEN14_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN14                */
#define _AGC_FENOTCHATT6_FENOTCHEN14_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT6            */
#define AGC_FENOTCHATT6_FENOTCHEN14_DEFAULT            (_AGC_FENOTCHATT6_FENOTCHEN14_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT6    */

