SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_agc.h
/* Bit fields for AGC FENOTCHATT11 */
#define _AGC_FENOTCHATT11_RESETVALUE                   0x200B200BUL                                       /**< Default value for AGC_FENOTCHATT11          */
#define _AGC_FENOTCHATT11_MASK                         0x3FFF3FFFUL                                       /**< Mask for AGC_FENOTCHATT11                   */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL23_SHIFT       0                                                  /**< Shift value for AGC_FENOTCHATTNSEL23        */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL23_MASK        0xFUL                                              /**< Bit mask for AGC_FENOTCHATTNSEL23           */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL23_DEFAULT     0x0000000BUL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHATTNSEL23_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHATTNSEL23_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE23_SHIFT       4                                                  /**< Shift value for AGC_FENOTCHCAPCRSE23        */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE23_MASK        0xF0UL                                             /**< Bit mask for AGC_FENOTCHCAPCRSE23           */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE23_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHCAPCRSE23_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHCAPCRSE23_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE23_SHIFT       8                                                  /**< Shift value for AGC_FENOTCHCAPFINE23        */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE23_MASK        0xF00UL                                            /**< Bit mask for AGC_FENOTCHCAPFINE23           */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE23_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHCAPFINE23_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHCAPFINE23_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define AGC_FENOTCHATT11_FENOTCHRATTNEN23              (0x1UL << 12)                                      /**< FE notch rattn enable for index 23          */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN23_SHIFT       12                                                 /**< Shift value for AGC_FENOTCHRATTNEN23        */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN23_MASK        0x1000UL                                           /**< Bit mask for AGC_FENOTCHRATTNEN23           */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN23_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHRATTNEN23_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHRATTNEN23_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define AGC_FENOTCHATT11_FENOTCHEN23                   (0x1UL << 13)                                      /**< FE notch enable for index 23                */
#define _AGC_FENOTCHATT11_FENOTCHEN23_SHIFT            13                                                 /**< Shift value for AGC_FENOTCHEN23             */
#define _AGC_FENOTCHATT11_FENOTCHEN23_MASK             0x2000UL                                           /**< Bit mask for AGC_FENOTCHEN23                */
#define _AGC_FENOTCHATT11_FENOTCHEN23_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHEN23_DEFAULT           (_AGC_FENOTCHATT11_FENOTCHEN23_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL24_SHIFT       16                                                 /**< Shift value for AGC_FENOTCHATTNSEL24        */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL24_MASK        0xF0000UL                                          /**< Bit mask for AGC_FENOTCHATTNSEL24           */
#define _AGC_FENOTCHATT11_FENOTCHATTNSEL24_DEFAULT     0x0000000BUL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHATTNSEL24_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHATTNSEL24_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE24_SHIFT       20                                                 /**< Shift value for AGC_FENOTCHCAPCRSE24        */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE24_MASK        0xF00000UL                                         /**< Bit mask for AGC_FENOTCHCAPCRSE24           */
#define _AGC_FENOTCHATT11_FENOTCHCAPCRSE24_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHCAPCRSE24_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHCAPCRSE24_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE24_SHIFT       24                                                 /**< Shift value for AGC_FENOTCHCAPFINE24        */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE24_MASK        0xF000000UL                                        /**< Bit mask for AGC_FENOTCHCAPFINE24           */
#define _AGC_FENOTCHATT11_FENOTCHCAPFINE24_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHCAPFINE24_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHCAPFINE24_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define AGC_FENOTCHATT11_FENOTCHRATTNEN24              (0x1UL << 28)                                      /**< FE notch rattn enable for index 24          */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN24_SHIFT       28                                                 /**< Shift value for AGC_FENOTCHRATTNEN24        */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN24_MASK        0x10000000UL                                       /**< Bit mask for AGC_FENOTCHRATTNEN24           */
#define _AGC_FENOTCHATT11_FENOTCHRATTNEN24_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHRATTNEN24_DEFAULT      (_AGC_FENOTCHATT11_FENOTCHRATTNEN24_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */
#define AGC_FENOTCHATT11_FENOTCHEN24                   (0x1UL << 29)                                      /**< FE notch enable for index 24                */
#define _AGC_FENOTCHATT11_FENOTCHEN24_SHIFT            29                                                 /**< Shift value for AGC_FENOTCHEN24             */
#define _AGC_FENOTCHATT11_FENOTCHEN24_MASK             0x20000000UL                                       /**< Bit mask for AGC_FENOTCHEN24                */
#define _AGC_FENOTCHATT11_FENOTCHEN24_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHATT11           */
#define AGC_FENOTCHATT11_FENOTCHEN24_DEFAULT           (_AGC_FENOTCHATT11_FENOTCHEN24_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT11   */

/* Bit fields for AGC FENOTCHFILT0 */
#define _AGC_FENOTCHFILT0_RESETVALUE                   0x00000000UL                                      /**< Default value for AGC_FENOTCHFILT0          */
#define _AGC_FENOTCHFILT0_MASK                         0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHFILT0                   */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL1_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL1         */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL1_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL1            */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL1_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHATTNSEL1_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHATTNSEL1_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE1_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE1         */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE1_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE1            */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE1_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHCAPCRSE1_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHCAPCRSE1_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE1_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE1         */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE1_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE1            */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE1_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHCAPFINE1_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHCAPFINE1_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define AGC_FENOTCHFILT0_FENOTCHRATTNEN1               (0x1UL << 12)                                     /**< FE notch rattn enable for index 1           */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN1_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN1         */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN1_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN1            */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN1_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHRATTNEN1_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHRATTNEN1_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define AGC_FENOTCHFILT0_FENOTCHEN1                    (0x1UL << 13)                                     /**< FE notch enable for index 1                 */
#define _AGC_FENOTCHFILT0_FENOTCHEN1_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN1              */
#define _AGC_FENOTCHFILT0_FENOTCHEN1_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN1                 */
#define _AGC_FENOTCHFILT0_FENOTCHEN1_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHEN1_DEFAULT            (_AGC_FENOTCHFILT0_FENOTCHEN1_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL2_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL2         */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL2_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL2            */
#define _AGC_FENOTCHFILT0_FENOTCHATTNSEL2_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHATTNSEL2_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHATTNSEL2_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE2_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE2         */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE2_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE2            */
#define _AGC_FENOTCHFILT0_FENOTCHCAPCRSE2_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHCAPCRSE2_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHCAPCRSE2_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE2_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE2         */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE2_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE2            */
#define _AGC_FENOTCHFILT0_FENOTCHCAPFINE2_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHCAPFINE2_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHCAPFINE2_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define AGC_FENOTCHFILT0_FENOTCHRATTNEN2               (0x1UL << 28)                                     /**< FE notch rattn enable for index 2           */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN2_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN2         */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN2_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN2            */
#define _AGC_FENOTCHFILT0_FENOTCHRATTNEN2_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHRATTNEN2_DEFAULT       (_AGC_FENOTCHFILT0_FENOTCHRATTNEN2_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */
#define AGC_FENOTCHFILT0_FENOTCHEN2                    (0x1UL << 29)                                     /**< FE notch enable for index 2                 */
#define _AGC_FENOTCHFILT0_FENOTCHEN2_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN2              */
#define _AGC_FENOTCHFILT0_FENOTCHEN2_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN2                 */
#define _AGC_FENOTCHFILT0_FENOTCHEN2_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT0           */
#define AGC_FENOTCHFILT0_FENOTCHEN2_DEFAULT            (_AGC_FENOTCHFILT0_FENOTCHEN2_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT0   */

/* Bit fields for AGC FENOTCHFILT1 */
#define _AGC_FENOTCHFILT1_RESETVALUE                   0x00000000UL                                      /**< Default value for AGC_FENOTCHFILT1          */
#define _AGC_FENOTCHFILT1_MASK                         0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHFILT1                   */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL3_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL3         */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL3_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL3            */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL3_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHATTNSEL3_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHATTNSEL3_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE3_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE3         */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE3_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE3            */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE3_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHCAPCRSE3_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHCAPCRSE3_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE3_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE3         */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE3_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE3            */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE3_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHCAPFINE3_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHCAPFINE3_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define AGC_FENOTCHFILT1_FENOTCHRATTNEN3               (0x1UL << 12)                                     /**< FE notch rattn enable for index 3           */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN3_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN3         */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN3_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN3            */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN3_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHRATTNEN3_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHRATTNEN3_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define AGC_FENOTCHFILT1_FENOTCHEN3                    (0x1UL << 13)                                     /**< FE notch enable for index 3                 */
#define _AGC_FENOTCHFILT1_FENOTCHEN3_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN3              */
#define _AGC_FENOTCHFILT1_FENOTCHEN3_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN3                 */
#define _AGC_FENOTCHFILT1_FENOTCHEN3_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHEN3_DEFAULT            (_AGC_FENOTCHFILT1_FENOTCHEN3_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL4_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL4         */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL4_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL4            */
#define _AGC_FENOTCHFILT1_FENOTCHATTNSEL4_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHATTNSEL4_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHATTNSEL4_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE4_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE4         */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE4_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE4            */
#define _AGC_FENOTCHFILT1_FENOTCHCAPCRSE4_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHCAPCRSE4_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHCAPCRSE4_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE4_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE4         */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE4_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE4            */
#define _AGC_FENOTCHFILT1_FENOTCHCAPFINE4_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHCAPFINE4_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHCAPFINE4_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define AGC_FENOTCHFILT1_FENOTCHRATTNEN4               (0x1UL << 28)                                     /**< FE notch rattn enable for index 4           */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN4_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN4         */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN4_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN4            */
#define _AGC_FENOTCHFILT1_FENOTCHRATTNEN4_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHRATTNEN4_DEFAULT       (_AGC_FENOTCHFILT1_FENOTCHRATTNEN4_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */
#define AGC_FENOTCHFILT1_FENOTCHEN4                    (0x1UL << 29)                                     /**< FE notch enable for index 4                 */
#define _AGC_FENOTCHFILT1_FENOTCHEN4_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN4              */
#define _AGC_FENOTCHFILT1_FENOTCHEN4_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN4                 */
#define _AGC_FENOTCHFILT1_FENOTCHEN4_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT1           */
#define AGC_FENOTCHFILT1_FENOTCHEN4_DEFAULT            (_AGC_FENOTCHFILT1_FENOTCHEN4_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT1   */

